do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == 'م1' then 
    local ghost = [[ 
‼️اوامر الحمايه المجموعة‼️
⚪️〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰⚪️
🔹طرد <معرف / رد> 〰 لطرد🔹
🔸كتم <معرف / رد> 〰 كتم 🔸
🔹حظر <معرف / رد> 〰 للحظر🔹
🔸الغاء الحظر <معرف / رد> 〰 الغاء الحظر 🔸
🔹قائمة المحظورين 〰 المحظورين🔹
🔸ايدي 〰 ايدي 🔸
🔹مغادرة 〰 للمغادرة🔹
🔴〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰🔴
🔘️اوامر الفتح و القفل المجموعة🔘
🔸قفل الصوت 〰 قفل الصوتيات🔸
🔹قفل الصور المتحركة 〰 منع المتحركة🔹
🔸قفل الصور 〰 منع الصور🔸
🔹قفل الفيديو 〰 منع الفيديوهات🔹
🔸قفل اعاده توجيه 〰 منع التوجيه🔸
🔹قفل التكرار 〰 منه التكرار🔹
🔸قفل البوتات 〰 منع البوتات🔸
🔹قفل الروابط 〰 منع الروابط🔹
🔸قفل الاضافه 〰 منع الاضافه🔸
🔹قفل الاضافه الجماعية 〰 منع الجماعية🔹
🔸قفل الكلايش 〰 منع الكلايش🔸
🔹قفل الدردشه 〰 منع المحادثة🔹
🔸قفل الاشعارات 〰 اشعارات الدخول🔸
🔹قفل جهات الاتصال 〰 جهات الاتصال🔹
🔸قفل العربيه 〰 اللغه العربيه🔸
🔵〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰🔵
 ✔️طريقة استخدام الاوامر✔️
🔷 قفل + الامر 🔚 للقفل 🔐
🔶فتح + الامر 🔚 للفتح 🔓
⚫️〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰⚫️
🔱 dev ➖ @sweetibot 
🔱 bot ➖ @msg4bot 
🔱 ch ➖ @qollop
  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(م1)$", 
}, 
run = run 
} 
end
